In [13]:
import pandas as pd

In [14]:
sr1 = pd.Series([1,2,3,4])
sr1

0    1
1    2
2    3
3    4
dtype: int64

In [15]:
sr2 = pd.Series([5,6,7,8,6,2])
sr2

0    5
1    6
2    7
3    8
4    6
5    2
dtype: int64

In [16]:
pd.concat([sr1,sr2])#concatination of Series

0    1
1    2
2    3
3    4
0    5
1    6
2    7
3    8
4    6
5    2
dtype: int64

In [17]:
df1=pd.DataFrame({'ID' : [1,2,3,4], 'Name' : ['A','H','k','m']})
df1

   ID Name
0   1    A
1   2    H
2   3    k
3   4    m

In [18]:
df2=pd.DataFrame({'ID' : [5,6,7,8], 'Name' : ['w','x','y','z']})
df2

   ID Name
0   5    w
1   6    x
2   7    y
3   8    z

In [19]:
pd.concat([df1,df2])#concatination of DataFrames

   ID Name
0   1    A
1   2    H
2   3    k
3   4    m
0   5    w
1   6    x
2   7    y
3   8    z

In [20]:
pd.concat([df1,df2],axis =1) #concatination of dataframes row wise(axis =1)

   ID Name  ID Name
0   1    A   5    w
1   2    H   6    x
2   3    k   7    y
3   4    m   8    z

In [23]:
 #concatination of dataframes by ignore the indexing 
pd.concat([df1,df2],axis=0, ignore_index = True)

   ID Name
0   1    A
1   2    H
2   3    k
3   4    m
4   5    w
5   6    x
6   7    y
7   8    z

In [35]:
df4 = pd.DataFrame({'ID' :[11,22,33,44],'dept': ['ECE', 'ME', 'IT','BM']})
df4

   ID dept
0  11  ECE
1  22   ME
2  33   IT
3  44   BM

In [36]:
df5 = pd.DataFrame({'ID': [44,55], 'dept':['CS','CE']})
df5

   ID dept
0  44   CS
1  55   CE

In [37]:
pd.concat([df4, df5])

   ID dept
0  11  ECE
1  22   ME
2  33   IT
3  44   BM
0  44   CS
1  55   CE

In [38]:
pd.concat([df4, df5], axis =1)

   ID dept    ID dept
0  11  ECE  44.0   CS
1  22   ME  55.0   CE
2  33   IT   NaN  NaN
3  44   BM   NaN  NaN

In [42]:
#inner join = it will concat only those row which have common index in both dataframes
pd.concat([df4, df5], join = 'inner',axis=1)

   ID dept  ID dept
0  11  ECE  44   CS
1  22   ME  55   CE

In [46]:
pd.concat([df4, df5], join = 'inner',axis=1, join_axes = [df4.index])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [51]:
pd.concat([df4, df5], keys = ['df1','df2'] )

       ID dept
df1 0  11  ECE
    1  22   ME
    2  33   IT
    3  44   BM
df2 0  44   CS
    1  55   CE

In [52]:
pd.concat([df4, df5], keys = ['first','second'] )

          ID dept
first  0  11  ECE
       1  22   ME
       2  33   IT
       3  44   BM
second 0  44   CS
       1  55   CE

In [53]:
pd.concat([df4, df5],axis= 1, keys = ['first','second'] )

  first      second
     ID dept     ID dept
0    11  ECE   44.0   CS
1    22   ME   55.0   CE
2    33   IT    NaN  NaN
3    44   BM    NaN  NaN